## Staging: redis
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_cloudwatch_log_group.weblate_redis_engine_logs will be created
  + resource "aws_cloudwatch_log_group" "weblate_redis_engine_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/elasticache/weblate/engine-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all          = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
    }

  # aws_cloudwatch_log_group.weblate_redis_slow_logs will be created
  + resource "aws_cloudwatch_log_group" "weblate_redis_slow_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/elasticache/weblate/slow-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all          = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
    }

  # aws_elasticache_subnet_group.weblate will be created
  + resource "aws_elasticache_subnet_group" "weblate" {
      + arn         = (known after apply)
      + description = "Weblate cluster subnet group"
      + id          = (known after apply)
      + name        = "weblate-staging"
      + subnet_ids  = [
          + "",
        ]
      + tags        = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all    = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
    }

  # aws_ssm_parameter.weblate_redis_auth_token will be created
  + resource "aws_ssm_parameter" "weblate_redis_auth_token" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "weblate-redis-auth_token"
      + tags           = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + weblate_redis_auth_token_secret_arn = (known after apply)

Error: no matching EC2 Subnet found

  with data.aws_subnet.weblate_private_subnet[""],
  on redis.tf line 55, in data "aws_subnet" "weblate_private_subnet":
  55: data "aws_subnet" "weblate_private_subnet" {

time=2023-11-06T06:39:38Z level=error msg=terraform invocation failed in /home/runner/work/localisation-services/localisation-services/terraform/env/staging/redis/.terragrunt-cache/ZuHqXA-Jcuej3YY2TeFHoUvqFis/eXXH5u-0ogAJzgeXDgG2KYualCU/redis prefix=[/home/runner/work/localisation-services/localisation-services/terraform/env/staging/redis] 
time=2023-11-06T06:39:38Z level=error msg=1 error occurred:
	* [/home/runner/work/localisation-services/localisation-services/terraform/env/staging/redis/.terragrunt-cache/ZuHqXA-Jcuej3YY2TeFHoUvqFis/eXXH5u-0ogAJzgeXDgG2KYualCU/redis] exit status 1



```

</details>

